# DataFrames

In [1]:
import numpy as np
import pandas as pd

In [2]:
filas = ['ventas1','ventas2','ventas3']
columnas = ['zonaA','zonaB','zonaC']
datos = [[123,345,567],[432,234,756],[987,123,457]]

In [3]:
dataframe = pd.DataFrame(datos,filas,columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    345    567
ventas2    432    234    756
ventas3    987    123    457

In [4]:
dataframe.loc[['ventas1','ventas2']]

         zonaA  zonaB  zonaC
ventas1    123    345    567
ventas2    432    234    756

In [5]:
dataframe['zonaA']

ventas1    123
ventas2    432
ventas3    987
Name: zonaA, dtype: int64

In [6]:
dataframe[['zonaA','zonaB']]

         zonaA  zonaB
ventas1    123    345
ventas2    432    234
ventas3    987    123

In [7]:
dataframe.loc['ventas2']['zonaB']

234

In [8]:
dataframe['TodasLasZonas'] = dataframe['zonaA']+dataframe['zonaB'] + dataframe['zonaC']
dataframe

         zonaA  zonaB  zonaC  TodasLasZonas
ventas1    123    345    567           1035
ventas2    432    234    756           1422
ventas3    987    123    457           1567

In [9]:
dataframe.drop('TodasLasZonas',axis=1)

         zonaA  zonaB  zonaC
ventas1    123    345    567
ventas2    432    234    756
ventas3    987    123    457

In [10]:
dataframe

         zonaA  zonaB  zonaC  TodasLasZonas
ventas1    123    345    567           1035
ventas2    432    234    756           1422
ventas3    987    123    457           1567

In [11]:
dataframe.drop('TodasLasZonas',axis=1, inplace = True) # Borra definitivamente la columna

In [12]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    345    567
ventas2    432    234    756
ventas3    987    123    457

In [13]:
dataframe.drop('ventas3', inplace = True)

In [14]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    345    567
ventas2    432    234    756

In [15]:
dataframe.shape

(2, 3)